## Module 1 Lab Answers

### SQL - Select

In [ ]:
%load_ext sql
%sql sqlite:///../../datasets/survey.db

Write a query to find all information on anyone in the Person table that has an id that contains an 'a'

In [ ]:
%%sql 
SELECT * 
FROM Person 
Where id LIKE '%a%'

Write a query to find all information from the Survey table where the quant is either rad or temp using a WHERE...IN() construct and where the person taking the reading is either pb or lake

In [ ]:
%%sql
SELECT * 
FROM Survey
WHERE quant in ('rad','temp')

Write a query to find all the people who have taken a temperature reading, removing repitition and ignoring empty values

In [ ]:
%%sql
SELECT DISTINCT person
FROM Survey
WHERE quant = 'temp'

Write a query to find the distinct taken numbers from the Survey table

In [ ]:
%%sql
SELECT DISTINCT taken
FROM Survey

Display all information from the Person table in alphabetical order by last name

In [ ]:
%%sql
SELECT *
FROM person
ORDER BY family

Display all temperature readings from the Survey table in numerical order with the highest temperature first

In [ ]:
%%sql
SELECT reading
FROM Survey
WHERE quant = 'temp'
ORDER BY reading DESC

Display two people from the `Person` table

In [ ]:
%%sql
SELECT *
FROM Person
Limit 2

Display three `rad` readings from the Survey table

In [ ]:
%%sql
SELECT reading
FROM Survey
WHERE quant = 'rad'
LIMIT 3

Find the 3 highest temperature readings

In [ ]:
%%sql
SELECT person, reading 
FROM Survey WHERE quant = 'temp'
ORDER BY reading DESC
LIMIT 3;

Write a query to display all readings made by someone whose id contains an 'e' and the reading was positive, from lowest to highest

In [ ]:
%%sql
SELECT reading
FROM SURVEY
WHERE person like '%e'
AND reading > 0
ORDER BY reading

### Joins

In [ ]:
%sql postgres://dsa_ro_user:readonly@dbase.dsa.missouri.edu/dsa_ro

1. Write a `SELECT` statement that joins the tables "us_second_order_divisions" and "util_us_states", then shows the `state_name` and `county_name`.

In [ ]:
%%sql 
SELECT state_name, county_name 
FROM us_second_order_divisions AS sod 
JOIN util_us_states AS uus 
    ON sod.state_number_code = uus.state_number_code;

Look at the first 5 rows in the `orders`

In [ ]:
%%sql
SELECT * FROM orders LIMIT 5;

Look at the first 5 rows in the `customers`

In [ ]:
%%sql
SELECT * FROM orders LIMIT 5;

  Write a SELECT statemet that displays all of the customers' names and zipcodes that have placed an order

In [ ]:
%%sql
SELECT customers.customer_id, orders.order_id, customers.customer_name, customers.zipcode
FROM orders 
JOIN customers 
USING(customer_id);

  Write a SELECT statement to display all customer names along with the price of their orders, if they have one
  
  
* Make sure to use a left join

In [ ]:
%%sql
SELECT customers.customer_name, orders.order_price 
FROM customers
LEFT JOIN orders 
USING(customer_id);

Write a SELECT statement to display all order ids and order prices, along with zipcode and country from which they were made, if there is one
* Make sure to use a left join

In [ ]:
%%sql
SELECT orders.order_id, orders.order_price, customers.zipcode, customers.country 
FROM orders
LEFT JOIN customers 
USING(customer_id);

Write a SELECT statement to display customer names and order ids for all orders, even if there is no customer associated with an order

* Make sure to use a right join

In [ ]:
%%sql
SELECT customers.customer_name, orders.order_id
FROM customers 
RIGHT JOIN orders 
USING (customer_id);

Change your statement from the previous step to display customer names and order ids for all customers, even if there is no order associated with a customer
* Make sure to use a right join

In [ ]:
%%sql
SELECT customers.customer_name, orders.order_id
FROM orders 
RIGHT JOIN customers 
USING (customer_id);

Write a SELECT statement to show the customer names, order ids, and price of all orders and customers

In [ ]:
%%sql
SELECT customers.customer_name, orders.order_id, orders.order_price
FROM orders 
FULL OUTER JOIN customers 
USING (customer_id);

Change your query from step 1 to display the contact name, country, customer id, and employee id for all customers and orders.

In [ ]:
%%sql
SELECT customers.contact_name, customers.country, customers.customer_id, orders.employee_id
FROM orders 
FULL OUTER JOIN customers 
USING (customer_id);

### Basic Aggregates

In [ ]:
%sql postgres://dsa_ro_user:readonly@dbase.dsa.missouri.edu/dsa_ro

Find the number of cities in China 

The number you receive should be 61

In [ ]:
%%sql
SELECT COUNT(*) FROM cities WHERE country = 'China';

Find the number of cities in Canada with a population greater than 2,000,000

The number you receive should be 1

In [ ]:
%%sql
SELECT COUNT(*) FROM cities WHERE country = 'Canada' AND
  population > 2000000;

Now what is we wanted to seach for the minimum population of cities in Japan.

How would we write this?

The number you recieve should be 1063100

In [ ]:
%%sql 
SELECT MIN(population) FROM cities WHERE country = 'Japan';

Now what if we wanted to search for the maximum population of cities in Canada. 

How would we write this?

The number you recieve should be 2600000

In [ ]:
%%sql 
SELECT MAX(population) FROM cities
WHERE country = 'Canada';

Now what if we wanted to find the average population of cities that are in the United States.

How would you write this?

The number you recieve should be 2385623.076923076923

In [ ]:
%%sql 
SELECT AVG(population) FROM cities
WHERE country = 'United States';

What if we wanted the sum of all people living in Canada or Mexico?

The number you should receive is 30334100

In [ ]:
%%sql
SELECT SUM(population) FROM cities
WHERE country IN ('Canada', 'Mexico');


Write a SELECT statement to display each country's name and its average city population

In [ ]:
%%sql
SELECT country, AVG(population)
FROM cities
GROUP BY country;

Write a SELECT statement to dipalay each country's name and the population of the city with the highest population

In [ ]:
%%sql
SELECT country, MAX(population)
FROM cities
GROUP BY country;

Write a SELECT statement to show each country's name and its average population but only for countries whose largest city has less than 5,000,000 people

In [ ]:
%%sql
SELECT country, AVG(population) FROM cities
GROUP BY country
HAVING MAX(population) < 5000000;

Write a SELECT statement to show each country's name and the population of its smallest city but only for countries with an average city population between 2 and 5 million people

In [ ]:
%%sql
SELECT country, MIN(population) FROM cities
GROUP BY country
HAVING AVG(population) > 2000000 AND AVG(population) < 5000000;

Write a SELECT statement that shows the state name and number of counties for states with less than 20 counties

In [ ]:
%%sql
SELECT s.state_name, COUNT(*)
FROM us_second_order_divisions
JOIN util_us_states s
USING(state_number_code)
GROUP BY s.state_name
HAVING COUNT(*) < 20;

Write a SELECT statement that shows the five state names with the fewest number of counties.

In [ ]:
%%sql
SELECT s.state_name
FROM us_second_order_divisions
JOIN util_us_states s
USING(state_number_code)
GROUP BY s.state_name
ORDER BY COUNT(*)
LIMIT 5;

### Nested Queries, Type I Subquery

In [ ]:
%sql postgres://dsa_ro_user:readonly@dbase.dsa.missouri.edu/dsa_ro

#### Q1) Use a type 1 nested query to do the following:
Write a SELECT statement that returns the state with the highest number of counties

In [ ]:
 %%sql
SELECT * FROM util_us_states
WHERE state_number_code IN(
  SELECT state_number_code
  FROM us_second_order_divisions
  GROUP BY state_number_code
  ORDER BY COUNT(*) DESC
  LIMIT 1
);

#### Q2) Use a type 1 nested query to do the following:<br>
 Write a SELECT statement that returns the state with the fewest number of counties

In [ ]:
%%sql
SELECT * FROM util_us_states
WHERE state_number_code IN(
  SELECT state_number_code
  FROM us_second_order_divisions
  GROUP BY state_number_code
  ORDER BY COUNT(*) ASC
  LIMIT 1
)

### Nested Queries, Type II Subquery

In [ ]:
%sql sqlite:////dsa/data/all_datasets/survey.db

Use a type 2 nested query to perform the following: 

Write a SELECT statement that returns all of the people who have not made a temperature reading

In [ ]:
%%sql
SELECT * FROM Person
WHERE NOT EXISTS(
  SELECT 'x' FROM Survey WHERE Person.id = Survey.person
    AND quant = 'temp'
)

### Nested Table Expressions

In [ ]:
%sql postgres://dsa_ro_user:readonly@dbase.dsa.missouri.edu/dvdrental

Write a query to find the number of actors who have appeared in more than 35 movies

In [ ]:
%%sql
SELECT COUNT(*)
FROM (
    SELECT actor_id, COUNT(*)
    FROM film_actor
    GROUP BY actor_id
    HAVING COUNT(*) > 35
    ) as rent_counts;

Write a query to find the number of rentals made by those renters who have checked out over 170 days of films

In [ ]:
%%sql
SELECT COUNT(*)
FROM rental
INNER JOIN (
        SELECT
            SUM(return_date - rental_date) as rental_time,
            MAX(return_date-rental_date), customer_id
        , COUNT(*) as cnt
        FROM rental
        GROUP BY customer_id 
        HAVING SUM(return_date - rental_date) > '170 days'::interval
    ) as top_renters
USING (customer_id)

### Advanced Aggregations

In [ ]:
%sql postgres://dsa_ro_user:readonly@dbase.dsa.missouri.edu/dsa_ro

Find the number of cities in China 

The number you receive should be 61

In [ ]:
%%sql
SELECT COUNT(*) FROM cities WHERE country = 'China';

Find the number of cities in Canada with a population greater than 2,000,000

The number you receive should be 1

In [ ]:
%%sql
SELECT COUNT(*) FROM cities WHERE country = 'Canada' AND
  population > 2000000;

Now what is we wanted to seach for the minimum population of cities in Japan.

How would we write this?

The number you recieve should be 1063100

In [ ]:
%%sql 
SELECT MIN(population) FROM cities WHERE country = 'Japan';

Now what if we wanted to search for the maximum population of cities in Canada. 

How would we write this?

The number you recieve should be 2600000

In [ ]:
%%sql 
SELECT MAX(population) FROM cities
WHERE country = 'Canada';

Now what if we wanted to find the average population of cities that are in the United States.

How would you write this?

The number you recieve should be 2385623.076923076923

In [ ]:
%%sql 
SELECT AVG(population) FROM cities
WHERE country = 'United States';

What if we wanted the sum of all people living in Canada or Mexico?

The number you should receive is 30334100

In [ ]:
%%sql
SELECT SUM(population) FROM cities
WHERE country IN ('Canada', 'Mexico');

Write a SELECT statement to display each country's name and its average city population

In [ ]:
%%sql
SELECT country, AVG(population)
FROM cities
GROUP BY country;

Write a SELECT statement to dipalay each country's name and the population of the city with the highest population

In [ ]:
%%sql
SELECT country, MAX(population)
FROM cities
GROUP BY country;

Write a SELECT statement to show each country's name and its average population but only for countries whose largest city has less than 5,000,000 people

In [ ]:
%%sql
SELECT country, AVG(population) FROM cities
GROUP BY country
HAVING MAX(population) < 5000000;

Write a SELECT statement to show each country's name and the population of its smallest city but only for countries with an average city population between 2 and 5 million people

In [ ]:
%%sql
SELECT country, MIN(population) FROM cities
GROUP BY country
HAVING AVG(population) > 2000000 AND AVG(population) < 5000000;

Write a SELECT statement that shows the state name and number of counties for states with less than 20 counties

In [ ]:
%%sql
SELECT s.state_name, COUNT(*)
FROM us_second_order_divisions
JOIN util_us_states s
USING(state_number_code)
GROUP BY s.state_name
HAVING COUNT(*) < 20;

Write a SELECT statement that shows the five state names with the fewest number of counties.

In [ ]:
%%sql
SELECT s.state_name
FROM us_second_order_divisions
JOIN util_us_states s
USING(state_number_code)
GROUP BY s.state_name
ORDER BY COUNT(*)
LIMIT 5;

### Database to Pandas and Visualization

In [ ]:
import psycopg2
import sqlalchemy

# Build up the client connection string
db_url = 'postgres://dsa_ro_user:readonly@dbase.dsa.missouri.edu/nyc-taxi-data'
        
# Connect to the DB
conn = sqlalchemy.create_engine(db_url, client_encoding='utf8')

Debug the following code that has a few errors.  
Below is the original code in read-only, then an executable cell.
Copy the code below into the cell to begin.

**Execute the cell, review the errors fix, repeat ... until you get your data!**

```Python
import pandas as pd

SQL = "SELECT dropoff_datetime::date,  sum(tip_amount) as tips"
SQL = "FROM goldman_sachs_dropoffs "
SQL += "extract(YEAR from dropoff_datetime) = 2015 " 
SQL += "GROUP BY dropoff_datetime::date "
SQL += "ORDER BY 1"

df_tips = pd.read_sql(SQL)
df_tips.head()
```

In [ ]:
# Add your code below
# ----------------------

import pandas as pd

SQL = "SELECT dropoff_datetime::date,  sum(tip_amount) as tips "
SQL += "FROM goldman_sachs_dropoffs "
SQL += "WHERE extract(YEAR from dropoff_datetime) = 2015 " 
SQL += "GROUP BY dropoff_datetime::date "
SQL += "ORDER BY 1"

df_tips = pd.read_sql(SQL, conn)
df_tips.head()

### Database to R and Visualization 
(This code will not execute as we are in a Python notebook.)

Debug the following code that has a few errors.  
Below is the original code in read-only, then an executable cell.
Copy the code below into the cell to begin.

**Execute the cell, review the errors fix, repeat ... until you get your data!**

```R

SQL <- paste("SELECT dropoff_datetime::date,  sum(tip_amount) as tips",
            "FROM goldman_sachs_dropoffs ",
            "extract(YEAR from dropoff_datetime) = 2015 " 
            "GROUP BY dropoff_datetime::date ",
            "ORDER BY 1"

df_tips =dbGetQuery(SQL)
df_tips.head()

In [ ]:
# Add your code below - It will not execute!
# ----------------------
SQL <- paste("SELECT dropoff_datetime::date,  sum(tip_amount) as tips ",
            "FROM goldman_sachs_dropoffs ",
            "WHERE extract(YEAR from dropoff_datetime) = 2015 " ,
            "GROUP BY dropoff_datetime::date ",
            "ORDER BY 1")

df_tips =dbGetQuery(conn, SQL)
head(df_tips)